#include <stdio.h>

int main() {
  // 二维数组是线性的，可以这样写
  int a1[3][4] = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12};
  forP(a1, 3, 4);
  // 或者
  int a2[3][4] = {{1, 2, 3, 4}, {5, 6, 7, 8}, {9, 10, 11, 12}};
  forP(a2, 3, 4);
  int a3[3][4] = {
			  [0] = {1, 2, 3, 4},
			  [1] = {5, 6, 7, 8},
			  [2] = {9, 10, 11, 12}
	  };

	//照样可以使用c99的初始化方式
	// int ..[][] = {[][] = ...}
  forP(a3, 3, 4);

  return 0;
}

// 二维数组作为参数必须 指明列数
void forP(int a[][4], int x, int y) {
  for (int i = 0; i < x; i++) {
    for (int j = 0; j < y; j++) {
      printf("%d ", a[i][j]);
    }
    printf("\n");
  }

  printf("=======================\n");
}
